{
    "documentaries": [
        {
            "id": 1,
            "poster": "../images/thebatman.jpg",
            "title": "The Batman",
            "year": "2022",
            "length": "2h 56m",
            "director": "Matt Reeves",
            "synopsis": "When a sadistic serial killer emerges in Gotham, Batman uncovers corruption that connects to his own family while facing the challenge of confronting a ruthless villain."
        },
        {
            "id": 2,
            "poster": "../images/terrifier.jpg",
            "title": "Terrifier 2",
            "year": "2022",
            "length": "2h 18m",
            "director": "Damien Leone",
            "synopsis": "Art the Clown returns to terrorize a new group of victims, this time haunting a young woman and her brother on Halloween night."
        },
        {
            "id": 3,
            "poster": "../images/deadpool.jpg",
            "title": "Deadpool",
            "year": "2016",
            "length": "1h 48m",
            "director": "Tim Miller",
            "synopsis": "Wade Wilson, a former special forces operative turned mercenary, gains extraordinary healing powers after a rogue experiment, and sets out to track down the man who ruined his life."
        },
        {
            "id": 4,
            "poster": "../images/flash.jpg",
            "title": "The Flash",
            "year": "2023",
            "length": "2h 24m",
            "director": "Andy Muschietti",
            "synopsis": "Barry Allen uses his super-speed powers to travel back in time to prevent his mother's death, but this causes unintended consequences that affect the timeline and the fate of the world."
        },
        {
            "id": 5,
            "poster": "../images/spiderman.jpg",
            "title": "Spider-Man: No Way Home",
            "year": "2021",
            "length": "2h 28m",
            "director": "Jon Watts",
            "synopsis": "Peter Parker seeks help from Doctor Strange to erase the public's memory of him being Spider-Man, leading to a multiverse collision with villains from other realities."
        },
        {
            "id": 6,
            "poster": "../images/doctor.png",
            "title": "Doctor Strange in the Multiverse of Madness",
            "year": "2022",
            "length": "2h 6m",
            "director": "Sam Raimi",
            "synopsis": "Doctor Strange seeks help from the Scarlet Witch to navigate the multiverse, facing threats from alternate realities and encountering new allies."
        },
        {
            "id": 7,
            "poster": "../images/panther.jpg",
            "title": "Black Panther: Wakanda Forever",
            "year": "2022",
            "length": "2h 41m",
            "director": "Ryan Coogler",
            "synopsis": "Wakanda faces a new threat as T'Challa's legacy is honored and his sister Shuri takes on a leading role in the nation's fight against the powerful Talokan."
        },
        {
            "id": 8,
            "poster": "../images/jurassic.jpg",
            "title": "Jurassic World: Dominion",
            "year": "2022",
            "length": "2h 27m",
            "director": "Colin Trevorrow",
            "synopsis": "Dinosaurs now roam freely in the world, and humanity must find a way to coexist with them while facing new dangers, including a genetically engineered threat."
        },
        {
            "id": 9,
            "poster": "../images/avatar.jpg",
            "title": "Avatar: The Way of Water",
            "year": "2022",
            "length": "3h 12m",
            "director": "James Cameron",
            "synopsis": "Jake Sully and Neytiri, now parents, are forced to protect their family when their peaceful life on Pandora is threatened by external forces and a deadly new adversary."
        }
    ]
}