{
    "movies": [
    {
        "id": 1,
        "poster": "../images/thebatman.jpg",
        "title": "The Batman",
        "year": "2022",
        "length": "2h 56m",
        "director": "Matt Reeves",
        "synopsis": "When a sadistic serial killer emerges in Gotham, Batman uncovers corruption...",
        "details": "The Batman presents a darker and grittier portrayal of Gotham's vigilante hero. Directed by Matt Reeves, this iteration explores Bruce Wayne's early days as the caped crusader, diving into his struggles with moral ambiguity and the dark corners of Gotham..."
    },
    {
        "id": 2,
        "poster": "../images/terrifier.jpg",
        "title": "Terrifier 2",
        "year": "2022",
        "length": "2h 18m",
        "director": "Damien Leone",
        "synopsis": "Art the Clown returns to terrorize a new group of victims...",
        "details": "Terrifier 2 raises the stakes with the return of Art the Clown, pushing the horror boundaries with even more graphic scenes and psychological terror..."
    },
    {
        "id": 3,
        "poster": "../images/deadpool.jpg",
        "title": "Deadpool",
        "year": "2016",
        "length": "1h 48m",
        "director": "Tim Miller",
        "synopsis": "Wade Wilson, a former special forces operative turned mercenary, gains extraordinary healing powers...",
        "details": "Deadpool is a unique superhero film that breaks the fourth wall and brings a refreshing sense of humor to the genre..."
    },
    {
        "id": 4,
        "poster": "../images/flash.jpg",
        "title": "The Flash",
        "year": "2023",
        "length": "2h 24m",
        "director": "Andy Muschietti",
        "synopsis": "Barry Allen uses his super-speed powers to travel back in time...",
        "details": "The Flash explores the concept of the multiverse, with Barry Allen using his powers to alter timelines..."
    },
    {
        "id": 5,
        "poster": "../images/spiderman.jpg",
        "title": "Spider-Man: No Way Home",
        "year": "2021",
        "length": "2h 28m",
        "director": "Jon Watts",
        "synopsis": "Peter Parker seeks help from Doctor Strange to erase the public's memory...",
        "details": "Spider-Man: No Way Home combines nostalgia with fresh excitement as characters from previous Spider-Man universes return..."
    },
    {
        "id": 6,
        "poster": "../images/doctor.png",
        "title": "Doctor Strange in the Multiverse of Madness",
        "year": "2022",
        "length": "2h 6m",
        "director": "Sam Raimi",
        "synopsis": "Doctor Strange seeks help from the Scarlet Witch...",
        "details": "Doctor Strange in the Multiverse of Madness, directed by Sam Raimi, expands on the concept of alternate realities..."
    },
    {
        "id": 7,
        "poster": "../images/panther.jpg",
        "title": "Black Panther: Wakanda Forever",
        "year": "2022",
        "length": "2h 41m",
        "director": "Ryan Coogler",
        "synopsis": "Wakanda faces a new threat as T'Challa's legacy is honored...",
        "details": "Black Panther: Wakanda Forever pays tribute to the late Chadwick Boseman while advancing the story of Wakanda..."
    },
    {
        "id": 8,
        "poster": "../images/jurassic.jpg",
        "title": "Jurassic World: Dominion",
        "year": "2022",
        "length": "2h 27m",
        "director": "Colin Trevorrow",
        "synopsis": "Dinosaurs now roam freely in the world...",
        "details": "Jurassic World: Dominion explores the consequences of dinosaurs coexisting with humans..."
    },
    {
        "id": 9,
        "poster": "../images/avatar.jpg",
        "title": "Avatar: The Way of Water",
        "year": "2022",
        "length": "3h 12m",
        "director": "James Cameron",
        "synopsis": "Jake Sully and Neytiri are forced to protect their family...",
        "details": "Avatar: The Way of Water brings audiences back to Pandora, introducing underwater ecosystems and expanding on the culture of the Na'vi..."
    },
    {
        "id": 10,
        "poster": "../images/inception.jpg",
        "title": "Inception",
        "year": "2010",
        "length": "2h 28m",
        "director": "Christopher Nolan",
        "synopsis": "A thief who steals corporate secrets through the use of dream-sharing technology is given a chance to have his criminal record erased...",
        "details": "Inception, directed by Christopher Nolan, is a mind-bending thriller that explores the depths of dreams within dreams. Known for its complex narrative and stunning visual effects, the film's dreamscapes are intricately designed to challenge reality. Leonardo DiCaprio leads a talented cast in a high-stakes heist to implant an idea into a CEO's mind, using the power of dreams. The production was notable for its use of practical effects and minimal CGI, creating visually stunning and immersive scenes."
    },
    {
        "id": 11,
        "poster": "../images/interstellar.jpg",
        "title": "Interstellar",
        "year": "2014",
        "length": "2h 49m",
        "director": "Christopher Nolan",
        "synopsis": "A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival...",
        "details": "Interstellar, directed by Christopher Nolan, is a groundbreaking sci-fi epic that explores space travel and the survival of humanity. The film's portrayal of space and black holes was praised for its scientific accuracy, aided by physicist Kip Thorne. With stunning visuals and a poignant emotional core, Interstellar blends exploration with human connections, as a group of astronauts searches for a new home for mankind."
    },
    {
        "id": 12,
        "poster": "../images/thegodfather.jpg",
        "title": "The Godfather",
        "year": "1972",
        "length": "2h 55m",
        "director": "Francis Ford Coppola",
        "synopsis": "The aging patriarch of an organized crime dynasty transfers control of his clandestine empire to his reluctant son...",
        "details": "The Godfather, directed by Francis Ford Coppola, is a cinematic masterpiece that defines the genre of gangster films. With Marlon Brando's iconic performance as Vito Corleone, the film delves into the complexities of family, loyalty, and crime. The movie's impact on cinema history is immense, with its realistic portrayal of power struggles within the mafia, and it remains a cultural touchstone."
    },
    {
        "id": 13,
        "poster": "../images/dunkirk.jpg",
        "title": "Dunkirk",
        "year": "2017",
        "length": "1h 46m",
        "director": "Christopher Nolan",
        "synopsis": "Allied soldiers from Belgium, the British Empire, and France are surrounded by the German army and evacuated during a fierce battle in World War II...",
        "details": "Dunkirk, directed by Christopher Nolan, is a war epic that captures the harrowing evacuation of soldiers during World War II. The film stands out for its realistic portrayal of combat, minimal dialogue, and immersive sound design. With a unique narrative structure that tells the story from three different perspectives (land, sea, and air), Dunkirk creates an intense and suspenseful experience."
    },
    {
        "id": 14,
        "poster": "../images/parasite.jpg",
        "title": "Parasite",
        "year": "2019",
        "length": "2h 12m",
        "director": "Bong Joon-ho",
        "synopsis": "A poor family schemes to become employed by a wealthy family and infiltrate their household, leading to a disastrous series of events...",
        "details": "Parasite, directed by Bong Joon-ho, is a darkly comedic thriller that explores social inequality. The film follows a poor family who gradually infiltrates the lives of a wealthy family, resulting in a shocking twist. With brilliant performances, sharp social commentary, and unexpected turns, Parasite became the first non-English language film to win the Academy Award for Best Picture."
    },
    {
        "id": 15,
        "poster": "../images/madmax.jpg",
        "title": "Mad Max: Fury Road",
        "year": "2015",
        "length": "2h",
        "director": "George Miller",
        "synopsis": "In a post-apocalyptic wasteland, Max teams up with a rebel warrior to escape a tyrannical warlord...",
        "details": "Mad Max: Fury Road, directed by George Miller, is a relentless action-packed ride set in a dystopian wasteland. Known for its practical effects and minimal CGI, the film received critical acclaim for its innovative cinematography and action sequences. Tom Hardy stars as Max, while Charlize Theron plays the fierce Furiosa. The film’s fast-paced narrative and visual style earned it multiple Academy Awards and redefined the action genre."
    },
    {
        "id": 16,
        "poster": "../images/whiplash.jpg",
        "title": "Whiplash",
        "year": "2014",
        "length": "1h 46m",
        "director": "Damien Chazelle",
        "synopsis": "A young drummer enrolls at a prestigious music conservatory where his dreams of greatness are mentored by an abusive instructor...",
        "details": "Whiplash, directed by Damien Chazelle, is a riveting drama that explores the extremes of ambition and the price of greatness. The film follows a young drummer, played by Miles Teller, who is pushed to his limits by a demanding and abusive music teacher, portrayed by J.K. Simmons. The intensity of their relationship and the music scenes are electrifying, making Whiplash one of the most memorable and tense films in recent years."
    },
    {
        "id": 17,
        "poster": "../images/arrival.jpg",
        "title": "Arrival",
        "year": "2016",
        "length": "1h 58m",
        "director": "Denis Villeneuve",
        "synopsis": "A linguist is recruited by the military to help communicate with alien lifeforms after twelve mysterious spacecraft appear around the world...",
        "details": "Arrival, directed by Denis Villeneuve, is a science fiction film that challenges the nature of communication and time. Amy Adams stars as a linguist tasked with decoding an alien language to prevent an intergalactic crisis. The film explores complex themes of memory, perception, and human connection, set against a backdrop of stunning visuals and a haunting score. Arrival is considered a modern sci-fi classic."
    },
    {
        "id": 18,
        "poster": "../images/thematrix.jpg",
        "title": "The Matrix",
        "year": "1999",
        "length": "2h 16m",
        "director": "The Wachowskis",
        "synopsis": "A computer hacker learns from mysterious rebels about the true nature of his reality and his role in the war against its controllers...",
        "details": "The Matrix, directed by The Wachowskis, is a groundbreaking science fiction film that blends action, philosophy, and visual effects. The story follows Neo, a hacker who discovers that the world he lives in is a simulated reality controlled by machines. The film is known for its revolutionary special effects, particularly the iconic 'bullet time' sequences, and its deep exploration of the nature of reality, free will, and human consciousness. The Matrix became a cultural phenomenon, influencing films and media for decades."
    }
    
]
}
